# Task 3. Import analysis libraries, and the new customer data set as a dataframe

In [16]:
# Importing necessary libraries

import pandas as pd
import numpy as np
import os

# Define the path to the data folder

In [15]:
# Define the path to the data folder

prepared_data_path = r'C:\Users\New User\OneDrive\Documents\05-2024 Instacart Basket Analysis\02 Data\Prepared Data'
original_data_path = r'C:\Users\New User\OneDrive\Documents\05-2024 Instacart Basket Analysis\02 Data\Original Data'

# Import the customer data set

In [21]:
# Import the customer data set

customers = pd.read_csv(os.path.join(original_data_path, 'customers.csv'))

# Load the existing orders_products_merged_updated.pkl dataframe

In [18]:
# Load the existing orders_products_merged_updated.pkl dataframe

ords_prods_merge = pd.read_pickle(os.path.join(prepared_data_path,'orders_products_merged_updated.pkl'))

# Display the first few rows of the dataframe

In [22]:
# Display the first few rows of the dataframe

print("Before renaming columns:")

customers.head()

Before renaming columns:

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Task 4: Wrangle the data so that it follows consistent logic

# Renaming columns to follow consistent logic and fixing any typos

In [23]:
# Renaming columns to follow consistent logic and fixing any typos

customers.rename(columns={
    'user_id': 'user_id',  # Keeping user_id as it to match with other dataframe
    'First Name': 'first_name',
    'Surnam': 'surname',
    'Gender': 'gender',
    'STATE': 'state',
    'Age': 'age',
    'date_joined': 'date_joined',
    'n_dependants': 'num_dependents',
    'fam_status': 'marital_status',
    'income': 'income'
}, inplace=True)

# Print the first few rows to confirm the changes

In [24]:
# Print the first few rows to confirm the changes

print("After renaming columns:")

customers.head()

After renaming columns:

,user_id,first_name,surname,gender,state,age,date_joined,num_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Dropping columns that don't add value to the analysis

In [25]:
# Dropping columns that don't add value to the analysis

customers.drop(columns=['first_name', 'surname', 'date_joined'], inplace=True)

# Display the first few rows after renaming and dropping columns

In [26]:
# Display the first few rows after renaming and dropping columns

customers.head()

   user_id  gender       state  age  num_dependents marital_status  income
0    26711  Female    Missouri   48               3        married  165665
1    33890  Female  New Mexico   36               0         single   59285
2    65803    Male       Idaho   35               2        married   99568
3   125935  Female        Iowa   40               0         single   42049
4   130797  Female    Maryland   26               1        married   40374

# Task 5: Complete the fundamental data quality and consistency checks

# Checking for missing values

In [27]:
# Checking for missing values

print(customers.isnull().sum())

user_id           0
gender            0
state             0
age               0
num_dependents    0
marital_status    0
income            0
dtype: int64

# Handling missing values (if any)

No missing data

# Checking for duplicates

In [28]:
# Checking for duplicates

print(customers.duplicated().sum())

0

# Removing duplicates (if any)

No duplicates present

# Checking data types

In [29]:
print("\nData types and non-null counts after cleaning:")

Data types and non-null counts after cleaning:

In [30]:
# print

customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   gender          206209 non-null  object
 2   state           206209 non-null  object
 3   age             206209 non-null  int64
 4   num_dependents  206209 non-null  int64
 5   marital_status  206209 non-null  object
 6   income          206209 non-null  int64
dtypes: int64(4), object(3)
memory usage: 11.0+ MB

In [31]:
# Checking data types

print(customers.dtypes)

user_id            int64
gender            object
state             object
age                int64
num_dependents     int64
marital_status    object
income             int64
dtype: object

# Converting data types if necessary

In [32]:
# Ensuring data types are correct

customers['user_id'] = customers['user_id'].astype(int)
customers['gender'] = customers['gender'].astype(str)
customers['state'] = customers['state'].astype(str)
customers['age'] = customers['age'].astype(int)
customers['num_dependents'] = customers['num_dependents'].astype(int)
customers['marital_status'] = customers['marital_status'].astype(str)
customers['income'] = customers['income'].astype(int)

# Final check of the dataframe

In [33]:
# Final check of the dataframe

print("\nFinal dataframe after data quality checks:")

customers.head()

Final dataframe after data quality checks:

   user_id  gender       state  age  num_dependents marital_status  income
0    26711  Female    Missouri   48               3        married  165665
1    33890  Female  New Mexico   36               0         single   59285
2    65803    Male       Idaho   35               2        married   99568
3   125935  Female        Iowa   40               0         single   42049
4   130797  Female    Maryland   26               1        married   40374

# Task 6: Combine the customer data with the rest of the prepared Instacart data

# Ensure the key columns are the same data type

In [34]:
# Ensure the key columns are the same data type

customers['user_id'] = customers['user_id'].astype(int)
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype(int)

# Merge the dataframes on 'user_id'

In [35]:
# Merge the dataframes on 'user_id'

merged_df = ords_prods_merge.merge(customers, on='user_id', how='left')

# Check the result of the merge

In [37]:
merged_df.head()

,order_id,product_id,add_to_cart_order,reordered,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,_merge,...,mean_price,spending_flag,median_days_since_last_order,order_frequency_flag,gender,state,age,num_dependents,marital_status,income
0,2,33120.0,1.0,1.0,202279,3,5,9,8.0,both,...,8.618889,Low spender,24.0,Non-frequent customer,Male,Idaho,57,3,married,98119
1,2,28985.0,2.0,1.0,202279,3,5,9,8.0,both,...,8.618889,Low spender,24.0,Non-frequent customer,Male,Idaho,57,3,married,98119
2,2,9327.0,3.0,0.0,202279,3,5,9,8.0,both,...,8.618889,Low spender,24.0,Non-frequent customer,Male,Idaho,57,3,married,98119
3,2,45918.0,4.0,1.0,202279,3,5,9,8.0,both,...,8.618889,Low spender,24.0,Non-frequent customer,Male,Idaho,57,3,married,98119
4,2,30035.0,5.0,0.0,202279,3,5,9,8.0,both,...,8.618889,Low spender,24.0,Non-frequent customer,Male,Idaho,57,3,married,98119

In [38]:
merged_df.shape

(32641268, 30)

# Task 8: Export this new dataframe as a pickle file

# Define the path for saving the new dataframe

In [39]:
# Define the path for saving the new dataframe

output_path = r'C:\Users\New User\OneDrive\Documents\05-2024 Instacart Basket Analysis\02 Data\Prepared Data\orders_products_merged_with_customers.pkl'

In [40]:
# Export the merged dataframe as a pickle file

merged_df.to_pickle(output_path)